Public Attributes | List of all members
API_StairRiserQuantity Struct Reference
Element Manager API
Calculated values for the stair riser. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
Volume of the riser.
double  | slantAngle
Slant angle of the given riser.
double  | width
The width of the given riser.
double  | frontArea
Front surface area of the riser.
Int32  | stepIndex
Step index of the given riser.
Int32  | filler
Detailed Description
Calculated values for the stair riser.
Member Data Documentation
◆ filler
 Int32 API_StairRiserQuantity::filler
◆ frontArea
 API_StairRiserQuantity::frontArea
Front surface area of the riser.
◆ slantAngle
 API_StairRiserQuantity::slantAngle
Slant angle of the given riser.
◆ stepIndex
 API_StairRiserQuantity::stepIndex
Step index of the given riser.
◆ volume
 API_StairRiserQuantity::volume
Volume of the riser.
◆ width
 API_StairRiserQuantity::width
The width of the given riser.